
/**
 * ロン和了時の点数（子）
 * 30符1翻(1000)〜役満(32000)
 */
export const RON_SCORES_KO = [
    1000, 1300, 1500, 1600, 2000, 2300, 2400, 2600, 2900, 3200,
    3600, 3900, 4500, 4800, 5200, 5800, 6000, 6400, 7100, 7700, 8000,
    9600, 11200, 11600, 12000, 12800, 16000, 18000, 24000, 32000,
]

/**
 * ロン和了時の点数（親）
 * 30符1翻(1500)〜役満(48000)
 */
export const RON_SCORES_OYA = [
    1500, 2000, 2400, 2900, 3400, 3600, 3900, 4400, 4800, 5300, 5800,
    6800, 7200, 7700, 8700, 9600, 10800, 11600, 12000, 14400, 16800, 18000,
    21600, 24000, 36000, 48000,
]

/**
 * ツモ和了時の親の支払い（子ツモ時）
 * または 親ツモ時のオール支払い（各家の支払い）
 */
export const TSUMO_SCORES_OYA_PART = [
    500, 700, 800, 1000, 1200, 1300, 1500, 1600, 1800, 2000,
    2300, 2400, 2600, 2900, 3200, 3600, 3900, 4000,
    6000, 8000, 12000, 16000,
]

/**
 * ツモ和了時の子の支払い（子ツモ時）
 */
export const TSUMO_SCORES_KO_PART = [
    300, 400, 500, 600, 700, 800, 900, 1000, 1200, 1300, 1500, 1600,
    1800, 2000, 3000, 4000, 6000, 8000,
]

// ドロップダウン表示用に整形するヘルパー関数
export const formatScoreOption = (score: number) => ({
    value: score,
    label: `${score.toLocaleString()}点`,
    // label: `${score}`, // シンプルに数字だけでもいいが、「点」があったほうが丁寧か
})
